Autodesk.Revit.DB.BuiltInFailures.RebarShapeFailures.InvalidCrankParametersCombination
Invalid combination of crank parameters.

Autodesk.Revit.DB.BuiltInFailures.RebarShapeFailures.CrankWithHookOrEndTreatmentAtTheSameEnd
Cannot add crank, hooks and end treatments at the same end.